// src/components/HomePage.js
import React from "react";
import { Link } from "react-router-dom";
import "../HomePage/HomePage.css"; // Импортируем CSS для стилей
import Header from "../Header/Header";

const Gramatik = () => {
  return (
    <div className="homepage">
      <Header />
      <aside className="sidebar">
        <ul className="menu">
          <li>
            <Link to="/section1">Психологическая база речи</Link>
          </li>
          <li>
            <Link to="/section2">Развитие лексической стороны речи</Link>
          </li>
          <li>
            <Link to="/section3">Развитие граматической стороны речи</Link>
          </li>
          <li>
            <Link to="/section4">Развитие связной речи</Link>
          </li>
          <li>
            <Link to="/section5">Обучение грамоте</Link>
          </li>
          <li>
            <Link to="/section6">Звукопроизношение</Link>
          </li>
          <li>
            <Link to="/section7">Мелкая моторика</Link>
          </li>
          <li>
            <Link to="/section8">Игры и игровые упражнения</Link>
          </li>
        </ul>
      </aside>
      <main className="main-content">
        <h1> Общая информация на тему развитие граматической стороны речи</h1>
        <p>
          Грамматический строй речи – это взаимодействие слов между собой в
          словосочетаниях и предложениях. Различают морфологическую и
          синтаксическую системы грамматического строя. Морфологическая система
          –это умение владеть приемами словоизменения и словообразования, а
          синтаксическая система – умение составлять предложения, грамматически
          верно сочетать слова в предложении, правильноиспользовать предлоги.
        </p>
        <p>
          Грамматический строй в процессе становления детской речи усваивается
          самостоятельно, благодаря подражанию речи окружающих. Основой для его
          формирования является повседневное общение ребенка с близкими
          взрослыми, совместная деятельность с ними. В семье такое общение
          возникает и разворачивается спонтанно, непреднамеренно. При этом важны
          благоприятные условия воспитания, достаточный уровень развития
          словаря, фонематического слуха, наличие активной речевой практики,
          состояние нервной системы ребенка.
        </p>

        <p>
          Происходит это постепенно, начиная с 1,5 – 2-х лет, когда у ребенка
          появляются первые фразы, а следовательно, необходимость смыслового
          соподчинения слов внутри них.
        </p>

        <p>
          К трем годам ребенок активно пользуется такими грамматическими
          категориями как род, число, время, лицо, говорит простыми
          распространенными предложениями.
        </p>

        <p>
          К четырем годам словарь ребенка вырастает до 2-х тысяч слов. В речи
          еще преобладают существительные, прилагательные и глаголы, но
          постепенно малыш начнет употреблять и другие части речи: местоимения,
          наречия, числительные.
        </p>

        <p>
          Важным показателем правильности речи ребенка на данном этапе является
          правильное использование предлогов и согласование существительных с
          прилагательными. Начинается формирование высказываний типа
          элементарных, коротких монологов (рассказов). У детей этого возраста
          фраза становится длиннее, количество слов в ней доходит до 4-6.Это
          связано с постоянным ростом словарного запаса, расширением сферы
          общения маленького человека. Как следствие этому увеличение числа
          грамматических ошибок в речи. Новые слова ребенок не всегда правильно
          произносит, не успевая следить за их смысловым содержанием и
          грамматической формой. Для дальнейшего речевого и интеллектуального
          развития важно, чтобы у малыша к этому времени был уже накоплен
          определенный словарный запас, и имелась возможность достаточной
          речевой практики. Пятый год жизни знаменуется становлением
          произвольности речи, формированием фонематического восприятия. Средний
          дошкольный возраст – 5-6 лет - период активного словотворчества. У
          малыша появляется интерес к слову, его звучанию. Ребенок создает
          собственные слова по знакомым ему грамматическим образцам. В
          результате появляются такие забавные слова как «рогаются» (бодаются),
          «насупился» (наелся супа).В этом проявляется стремление малыша усвоить
          звуковой состав слова, приблизив его звуковое обозначение к
          смысловому.
        </p>
        <p>
          Шестой и седьмой год жизни - этап овладения способами грамматически
          правильного построения развернутых связных высказываний, активного
          освоения сложного синтаксиса при произвольном построении монолога,
          этап формирования грамматически и фонетически правильной речи,
          освоения способов вычленения из речи (осознания) предложения, слова,
          звука. Словарь ребенка этого возраста достигает 3-3.5 тысяч слов.
          Важнейшим показателем уровня речевого развития ребенка этого возраста
          является умение легко подобрать нужные слова, умение использовать
          устойчивые словосочетания, употреблять образные слова и выражения.
          Хотя в речи ребенка еще могут наблюдаться ненормативные варианты
          словообразования и словоизменения. Управление грамматическим развитием
          ребенка должно осуществляться прежде всего через организацию
          специальной совместной со взрослым деятельности, а также через общение
          ребенка с педагогом и другими детьми. Основным, и конечно же, самым
          главным и очень эффективным видом совместной деятельности ребенка и
          взрослого, направленной на формирование грамматического строя речи
          является игра. Существует большое количество речевых игр, помогающих
          развивать грамматическую сторону речи ребенка. Вот лишь некоторые из
          них:Шестой и седьмой год жизни - этап овладения способами
          грамматически правильного построения развернутых связных высказываний,
          активного освоения сложного синтаксиса при произвольном построении
          монолога, этап формирования грамматически и фонетически правильной
          речи, освоения способов вычленения из речи (осознания) предложения,
          слова, звука. Словарь ребенка этого возраста достигает 3-3.5 тысяч
          слов. Важнейшим показателем уровня речевого развития ребенка этого
          возраста является умение легко подобрать нужные слова, умение
          использовать устойчивые словосочетания, употреблять образные слова и
          выражения. Хотя в речи ребенка еще могут наблюдаться ненормативные
          варианты словообразования и словоизменения. Управление грамматическим
          развитием ребенка должно осуществляться прежде всего через организацию
          специальной совместной со взрослым деятельности, а также через общение
          ребенка с педагогом и другими детьми. Основным, и конечно же, самым
          главным и очень эффективным видом совместной деятельности ребенка и
          взрослого, направленной на формирование грамматического строя речи
          является игра. Существует большое количество речевых игр, помогающих
          развивать грамматическую сторону речи ребенка.
        </p>
        <h1>Причеры упражениний</h1>
        <h2> Игра «Один-много»</h2>
        <p>
          Взрослый бросает ребенку мяч и называет существительное в единственном
          числе, ребенок возвращает мяч, называя это существительное во
          множественном числе.
        </p>
        <p>
          Примерный лексический материал: мяч - мячи, машина – машины, кукла –
          куклы, кубик- кубики и т.д.
        </p>
        <h2> Игра «Назови ласково»</h2>
        <p>
          Взрослый называет слово и бросает мяч ребенку, ребенок должен
          перекинуть мяч и назвать слово ласково.
        </p>
        <p>
          Примерный лексический материал: мяч-мячик, машина - машинка, дом -
          домик, кукла -куколка и т.д.
        </p>
        <h2> Игра «Чего не стало»</h2>
        <p>
          Взрослый выкладывает перед ребенком несколько различных предметов – 4
          – 7 штук. Затем просит ребенка запомнить все предметы и отвернуться, а
          сам в это время убирает один любой предмет. Ребенку предлагается
          посмотреть внимательно и назвать, чего не стало. Обязательно нужно
          обращать внимание на окончания в словах, названныхребенком.
        </p>
        <p>
          Примерный лексический материал: Кукла, мяч, машина, матрешка, самолет.
        </p>
        <h2> Игра «Сосчитай до 5»</h2>
        <p>
          Детям предлагается сосчитать до пяти с заданным словом: один мяч, два
          мяча…, пять мячей… Примерный лексический материал: один карандаш, два
          карандаша, три карандаша, четыре карандаша, пять карандашей; одна
          машина, две машины, три машины, четыре машины, пять машин; один ключ,
          два ключа, три ключа, четыре ключа, пять ключей и т.д. Задание можно
          усложнить, предложив ребенку сосчитать до пяти со словосочетаниями:
          один синий мяч, два синих мяча….
        </p>
        <h2> Игра «Жадина и щедрый»</h2>
        <p>
          Предложите ребенку научиться распознавать жадин. Жадина всегда
          говорит, что все игрушки его. Попросите ребенка побыть немножко
          жадиной. Предложите ему образец ответа на ваш вопрос: «Чья корова? –
          Корова моя. Чей поросенок? – Поросенок мой». Спросите ребенка,
          понравилось ли ему быть жадиной. Предложите (ему) стать щедрым
          ребенком. Проведите игру «наоборот»: «Чья корова? – Корова твоя (или
          ваша)».
        </p>
        <p>
          Примерный лексический материал: Чья кофта? – кофта моя. Чей шарф? –
          Шарфмойи т.д. Чья книга –твоя книга; чьи игрушки –твои игрушки и т.д.
        </p>
        <h2> Игра «Из чего какой»</h2>
        <p>
          Взрослый называет предмет и материал из которого он сделан, а ребенок
          в ответ прилагательное характеризующее этот предмет.
        </p>
        <p>
          Примерный лексический материал: дом из камня – каменный, чашка из
          фарфора –фарфоровая, солдатик из олова –оловянный, мяч из резины
          –резиновый, ложка из дерева –деревянная и т.д.
        </p>
        <h2> Игра «Чей хвост, чьи уши, чья голова»</h2>
        <p>
          Взрослый называет животное и спрашивает о любой части тела этого
          животного, чья она. Взрослый может нарисовать фантастическое животное,
          состоящее из частей различных животных и попросить ребенка назвать
          части тела какого животного он видит на рисунке (Например: кошачья
          голова, львиное туловище, утиные лапы и т.д.).
        </p>
        <p>
          Примерный лексический материал: Голова кошки чья? (кошачья), уши зайца
          чьи (заячьи), хвост волка чей? (волчий).
        </p>
        <h2> Игра «Подбирай, называй, запоминай»</h2>
        <p>
          Взрослый просит ребенка, рассказать о каком – то предмете, подобрав
          как можно больше слов признаков и слов действий к предложенному слову.
        </p>
        <p>
          Примерный лексический материал: Снег какой? (пушистый, белый,
          холодный…) Снег что делает? (падает, на солнце блестит, переливается,
          тает…) Лед (какой?)- холодный, блестящий, прозрачный, твердый и т.д.
          Лед (что делает?)- трещит, блестит, тает. Переливается и т.д.
        </p>
        <h2> Игра «Волшебные очки»</h2>
        <p>
          Взрослый говорит: «Представь, что у нас есть волшебные очки. Когда их
          надеваешь, то все становится красным (зеленым, желтым, синим и т.д.).
          Посмотри вокруг в волшебные очки, какого цвета все стало, скажи».
        </p>
        <p>
          Примерный лексический материал: красный мяч, красные сапоги,
          красноеплатье, красныйнос.Красноеокно, краснаярукаипрочие.
        </p>
      </main>
    </div>
  );
};

export default Gramatik;
